RIOT-OS/RIOT/cpu/sam0_common/include/vendor/samr30/include/samr30g18a.h
/**
 * \file
 *
 * \brief Header file for SAMR30G18A
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMR30G18A_
#define _SAMR30G18A_

/**
 * \ingroup SAMR30_definitions
 * \addtogroup SAMR30G18A_definitions SAMR30G18A definitions
 * This file defines all structures and symbols for SAMR30G18A:
 *   - registers and bitfields
 *   - peripheral base address
 *   - peripheral ID
 *   - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint32_t WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */
#if !defined(_UL)
#define _U(x)          x ## U            /**< C code: Unsigned integer literal constant value */
#define _L(x)          x ## L            /**< C code: Long integer literal constant value */
#define _UL(x)         x ## UL           /**< C code: Unsigned Long integer literal constant value */
#endif
#else
#if !defined(_UL)
#define _U(x)          x                 /**< Assembler: Unsigned integer literal constant value */
#define _L(x)          x                 /**< Assembler: Long integer literal constant value */
#define _UL(x)         x                 /**< Assembler: Unsigned Long integer literal constant value */
#endif
#endif

/* ************************************************************************** */
/**  CMSIS DEFINITIONS FOR SAMR30G18A */
/* ************************************************************************** */
/** \defgroup SAMR30G18A_cmsis CMSIS Definitions */
/*@{*/

/** Interrupt Number Definition */
typedef enum IRQn
{
  /******  Cortex-M0+ Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn      = -14,/**<  2 Non Maskable Interrupt                 */
  HardFault_IRQn           = -13,/**<  3 Cortex-M0+ Hard Fault Interrupt        */
  SVCall_IRQn              = -5, /**< 11 Cortex-M0+ SV Call Interrupt           */
  PendSV_IRQn              = -2, /**< 14 Cortex-M0+ Pend SV Interrupt           */
  SysTick_IRQn             = -1, /**< 15 Cortex-M0+ System Tick Interrupt       */
  /******  SAMR30G18A-specific Interrupt Numbers ***********************/
  SYSTEM_IRQn              =  0, /**<  0 SAMR30G18A System Interrupts */
  WDT_IRQn                 =  1, /**<  1 SAMR30G18A Watchdog Timer (WDT) */
  RTC_IRQn                 =  2, /**<  2 SAMR30G18A Real-Time Counter (RTC) */
  EIC_IRQn                 =  3, /**<  3 SAMR30G18A External Interrupt Controller (EIC) */
  NVMCTRL_IRQn             =  4, /**<  4 SAMR30G18A Non-Volatile Memory Controller (NVMCTRL) */
  DMAC_IRQn                =  5, /**<  5 SAMR30G18A Direct Memory Access Controller (DMAC) */
  USB_IRQn                 =  6, /**<  6 SAMR30G18A Universal Serial Bus (USB) */
  EVSYS_IRQn               =  7, /**<  7 SAMR30G18A Event System Interface (EVSYS) */
  SERCOM0_IRQn             =  8, /**<  8 SAMR30G18A Serial Communication Interface 0 (SERCOM0) */
  SERCOM1_IRQn             =  9, /**<  9 SAMR30G18A Serial Communication Interface 1 (SERCOM1) */
  SERCOM2_IRQn             = 10, /**< 10 SAMR30G18A Serial Communication Interface 2 (SERCOM2) */
  SERCOM3_IRQn             = 11, /**< 11 SAMR30G18A Serial Communication Interface 3 (SERCOM3) */
  SERCOM4_IRQn             = 12, /**< 12 SAMR30G18A Serial Communication Interface 4 (SERCOM4) */
  SERCOM5_IRQn             = 13, /**< 13 SAMR30G18A Serial Communication Interface 5 (SERCOM5) */
  TCC0_IRQn                = 14, /**< 14 SAMR30G18A Timer Counter Control 0 (TCC0) */
  TCC1_IRQn                = 15, /**< 15 SAMR30G18A Timer Counter Control 1 (TCC1) */
  TCC2_IRQn                = 16, /**< 16 SAMR30G18A Timer Counter Control 2 (TCC2) */
  TC0_IRQn                 = 17, /**< 17 SAMR30G18A Basic Timer Counter 0 (TC0) */
  TC1_IRQn                 = 18, /**< 18 SAMR30G18A Basic Timer Counter 1 (TC1) */
  TC4_IRQn                 = 21, /**< 21 SAMR30G18A Basic Timer Counter 4 (TC4) */
  ADC_IRQn                 = 22, /**< 22 SAMR30G18A Analog Digital Converter (ADC) */
  AC_IRQn                  = 23, /**< 23 SAMR30G18A Analog Comparators (AC) */
  PTC_IRQn                 = 25, /**< 25 SAMR30G18A Peripheral Touch Controller (PTC) */

  PERIPH_COUNT_IRQn        = 29  /**< Number of peripheral IDs */
} IRQn_Type;

